; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	image1 - mode
	thermograph0 - mode
	Star0 - direction
	GroundStation2 - direction
	GroundStation6 - direction
	GroundStation1 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	Star5 - direction
	Star7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Star11 - direction
	Planet12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 GroundStation6)
	(supports instrument1 image1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation6)
	(supports instrument2 image1)
	(calibration_target instrument2 Star5)
	(supports instrument3 thermograph0)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation6)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star11)
	(supports instrument4 thermograph0)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation4)
	(calibration_target instrument4 GroundStation1)
	(supports instrument5 thermograph0)
	(supports instrument5 image1)
	(calibration_target instrument5 Star5)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star7)
	(supports instrument6 image1)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 GroundStation3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star11)
	(supports instrument7 image1)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 Star5)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon9)
)
(:goal (and
	(pointing satellite1 Star0)
	(pointing satellite2 GroundStation2)
	(pointing satellite3 Star5)
	(pointing satellite4 GroundStation6)
	(have_image Star7 thermograph0)
	(have_image Phenomenon8 image1)
	(have_image Phenomenon9 image1)
	(have_image Star10 image1)
	(have_image Star11 thermograph0)
	(have_image Planet12 image1)
	(have_image Phenomenon13 image1)
))

)

; plan
1. (turn_to satellite4 groundstation6 phenomenon9)
   deleted: (pointing satellite4 phenomenon9)
   added: (pointing satellite4 groundstation6)
   goals met: 1 of 11
2. (turn_to satellite3 star5 star11)
   deleted: (pointing satellite3 star11)
   added: (pointing satellite3 star5)
   goals met: 2 of 11
3. (turn_to satellite2 groundstation2 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 groundstation2)
   goals met: 3 of 11
4. (turn_to satellite1 star0 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star0)
   goals met: 4 of 11
5. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 11
6. (calibrate satellite0 instrument0 groundstation6)
   added: (calibrated instrument0)
   goals met: 4 of 11
7. (turn_to satellite0 phenomenon8 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 phenomenon8)
   goals met: 4 of 11
8. (take_image satellite0 phenomenon8 instrument0 image1)
   added: (have_image phenomenon8 image1)
   goals met: 5 of 11
9. (turn_to satellite0 phenomenon13 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon13)
   goals met: 5 of 11
10. (take_image satellite0 phenomenon13 instrument0 image1)
   added: (have_image phenomenon13 image1)
   goals met: 6 of 11
11. (turn_to satellite0 phenomenon9 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon9)
   goals met: 6 of 11
12. (take_image satellite0 phenomenon9 instrument0 image1)
   added: (have_image phenomenon9 image1)
   goals met: 7 of 11
13. (turn_to satellite0 planet12 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet12)
   goals met: 7 of 11
14. (take_image satellite0 planet12 instrument0 image1)
   added: (have_image planet12 image1)
   goals met: 8 of 11
15. (turn_to satellite0 star10 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 star10)
   goals met: 8 of 11
16. (take_image satellite0 star10 instrument0 image1)
   added: (have_image star10 image1)
   goals met: 9 of 11
17. (turn_to satellite0 star11 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star11)
   goals met: 9 of 11
18. (take_image satellite0 star11 instrument0 thermograph0)
   added: (have_image star11 thermograph0)
   goals met: 10 of 11
19. (turn_to satellite0 star7 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star7)
   goals met: 10 of 11
20. (take_image satellite0 star7 instrument0 thermograph0)
   added: (have_image star7 thermograph0)
   goals met: 11 of 11
